spec/support/fixtures/vcr_cassettes/PayoutsHelper/payout_period_data/shows_user_s_affiliate_credits_and_fees_separately.yml

---
http_interactions:
- request:
    method: post
    uri: https://api-3t.sandbox.paypal.com/nvp
    body:
      encoding: UTF-8
      string: USER=<PAYPAL_USERNAME>&PWD=<PAYPAL_PASSWORD>&SIGNATURE=<PAYPAL_SIGNATURE>&VERSION=90.0&CURRENCYCODE=USD&METHOD=MassPay&RECEIVERTYPE=EmailAddress&L_EMAIL0=balance%40gumroad.com&L_AMT0=189.75&L_UNIQUEID0=8&L_NOTE0=Chuck%20Bartowski%2C%20selling%20%20products
    headers:
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Correlation-Id:
      - a2bf8f0642ba9
      Cache-Control:
      - max-age=0, no-cache, no-store, must-revalidate
      Content-Length:
      - '108'
      Content-Type:
      - text/plain;charset=UTF-8
      Date:
      - Fri, 02 Oct 2020 18:30:03 GMT
      Paypal-Debug-Id:
      - a2bf8f0642ba9
      X-Paypal-Api-Rc:
      - ''
      X-Paypal-Operation-Name:
      - MassPay
      X-Slr-Retry-Api:
      - MassPay
    body:
      encoding: UTF-8
      string: TIMESTAMP=2020%2d10%2d02T18%3a30%3a03Z&CORRELATIONID=a2bf8f0642ba9&ACK=Success&VERSION=90%2e0&BUILD=53356671
  recorded_at: Fri, 02 Oct 2020 18:30:03 GMT
- request:
    method: post
    uri: https://api-3t.sandbox.paypal.com/nvp
    body:
      encoding: UTF-8
      string: USER=<PAYPAL_USERNAME>&PWD=<PAYPAL_PASSWORD>&SIGNATURE=<PAYPAL_SIGNATURE>&VERSION=90.0&CURRENCYCODE=USD&METHOD=MassPay&RECEIVERTYPE=EmailAddress&L_EMAIL0=seller-balance%40gumroad.com&L_AMT0=159.75&L_UNIQUEID0=9&L_NOTE0=Chuck%20Bartowski%2C%20selling%20%20products
    headers:
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Correlation-Id:
      - 589905e45e7b9
      Cache-Control:
      - max-age=0, no-cache, no-store, must-revalidate
      Content-Length:
      - '108'
      Content-Type:
      - text/plain;charset=UTF-8
      Date:
      - Fri, 02 Oct 2020 18:30:04 GMT
      Paypal-Debug-Id:
      - 589905e45e7b9
      X-Paypal-Api-Rc:
      - ''
      X-Paypal-Operation-Name:
      - MassPay
      X-Slr-Retry-Api:
      - MassPay
    body:
      encoding: UTF-8
      string: TIMESTAMP=2020%2d10%2d02T18%3a30%3a04Z&CORRELATIONID=589905e45e7b9&ACK=Success&VERSION=90%2e0&BUILD=53356671
  recorded_at: Fri, 02 Oct 2020 18:30:04 GMT
- request:
    method: post
    uri: https://api-3t.sandbox.paypal.com/nvp
    body:
      encoding: UTF-8
      string: USER=<PAYPAL_USERNAME>&PWD=<PAYPAL_PASSWORD>&SIGNATURE=<PAYPAL_SIGNATURE>&VERSION=90.0&CURRENCYCODE=USD&METHOD=MassPay&RECEIVERTYPE=EmailAddress&L_EMAIL0=affiliate-balance%40gumroad.com&L_AMT0=30.0&L_UNIQUEID0=10&L_NOTE0=Chuck%20Bartowski%2C%20selling%20%20products
    headers:
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Correlation-Id:
      - 848a9e92bfee2
      Cache-Control:
      - max-age=0, no-cache, no-store, must-revalidate
      Content-Length:
      - '108'
      Content-Type:
      - text/plain;charset=UTF-8
      Date:
      - Fri, 02 Oct 2020 18:30:06 GMT
      Paypal-Debug-Id:
      - 848a9e92bfee2
      X-Paypal-Api-Rc:
      - ''
      X-Paypal-Operation-Name:
      - MassPay
      X-Slr-Retry-Api:
      - MassPay
    body:
      encoding: UTF-8
      string: TIMESTAMP=2020%2d10%2d02T18%3a30%3a06Z&CORRELATIONID=848a9e92bfee2&ACK=Success&VERSION=90%2e0&BUILD=53356671
  recorded_at: Fri, 02 Oct 2020 18:30:06 GMT
recorded_with: VCR 6.0.0
